# Viewport View Anchor Property

Source: https://www.revitapidocs.com/2026/75cd9b80-73f4-c72b-3770-24b6901b424d.htm

---

| Viewport View Anchor Property |
| --- |

Specifies the method by which the view will be positioned on the sheet and for the case when it is swapped to another view. Default is set to ViewAnchor.ViewOrigin.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ViewAnchor ViewAnchor { get; }
```

```
Public ReadOnly Property ViewAnchor As ViewAnchor
	Get
```

```
public:
property ViewAnchor ViewAnchor {
	ViewAnchor get ();
}
```

```
member ViewAnchor : ViewAnchor with get
```

#### Property Value

ViewAnchor See Also

#### Reference

Viewport Class Autodesk.Revit.DB Namespace